import React from "react";

export const Data = {
  1: {
    header: (
      <>
        <p
          style={{
            maxWidth: 300,
          }}
        >
          เราขอตรวจสอบคุณว่ามีความเสี่ยง ที่จะป่วยเป็นโรค
          <span style={{ color: "red" }}> COVID-19</span> หรือไม่
          <span style={{ color: "#86A5C4" }}>
            (ในช่วงเวลา 14 วัน ก่อนเริ่มป่วย)
          </span>
        </p>
      </>
    ),
    data: [
      "มีประวัติการเดินทางไป/กลับ ต่างประเทศ",
      "ไปพื้นที่ควบคุมสูงสุดและเข้มงวด",
      "ไปสถานที่ที่มีผู้คนแออัด",
      "สัมผัสใกล้ชิดกับผู้ป่วย COVID-19",
    ],
  },
  2: {
    header1: (
      <>
        <p>
          - มีประวัติเดินทางไป/กลับ จากต่างประเทศ <br />- สัมผัสใกล้ชิดผู้ป่วย
          COVID-19
        </p>
      </>
    ),
    header2: "เราขอสอบถามอาการของคุณ",
    data: [
      "มีไข้",
      "ไอ",
      "มีน้ำมูก",
      "เจ็บคอ",
      "หายใจลำบาก หรือ จมูกไม่ได้กลิ่น",
      "ลิ้นไม่รู้รส",
    ],
    tail: (
      <>
        <p
          style={{
            opacity: 0.9,
            wordWrap: "break-word",
          }}
        >
          ถ้าคุณไม่มีอาการดังต่อไปนี้ สามารถกดปุ่ม{" "}
          <span
            style={{
              color: "var(--brick)",
            }}
          >
            Submit{" "}
          </span>
          เพื่อทำการวิเคระห์ผลได้เลย!
        </p>
      </>
    ),
  },
};
